===
Empty parameters
===

PARAM ()

$a

---

(script
  (param_block)
  (script_block (statement (user_variable))))

===
Single parameter with type defined (with lowercase too)
===

param (
  $arg1
)

$a

---

(script
  (param_block
    (parameter_declaration (user_variable)))
  (script_block (statement (user_variable))))

===
Single parameter with type defined
===

PARAM (
  [string] $arg1
)

$a

---

(script
  (param_block
    (parameter_declaration
      (attribute (identifier)) (user_variable)))
  (script_block (statement (user_variable))))

===
Multiple parameters with types
===

PARAM (
  [string] $arg1
  [string] $arg2
)

$a

---

(script
  (param_block
    (parameter_declaration
      (attribute (identifier)) (user_variable))
    (parameter_declaration
      (attribute (identifier)) (user_variable)))
  (script_block (statement (user_variable))))

===
Multiple parameters with types, separated by commas
===

PARAM (
  [string] $arg1,
  [string] $arg2
)

$a

---

(script
  (param_block
    (parameter_declaration
      (attribute (identifier)) (user_variable))
    (parameter_declaration
      (attribute (identifier)) (user_variable)))
  (script_block (statement (user_variable))))

===
Multiple parameters with multiple attributes, separated by commas
===

PARAM (
  [Parameter]
  [string]
  $arg1,
  [Parameter] [string] $arg2
)

$a

---

(script
  (param_block
    (parameter_declaration
      (attribute (identifier)) (attribute (identifier)) (user_variable))
    (parameter_declaration
      (attribute (identifier)) (attribute (identifier)) (user_variable)))
  (script_block (statement (user_variable))))
