===
Empty parameters
===

PARAM ()

$a

---

(script
  (script_block
    (param_block (parameter_list))
    (statement_list
      (statement (variable)))))

===
Single parameter with type defined (with lowercase too)
===

param ($arg1)

$true

---

(script
  (script_block
  (param_block
    (parameter_list (parameter_declaration (variable))))
  (statement_list
     (statement (boolean_value)))))

===
Single parameter with type defined
===

PARAM ([string] $arg1)

$true

---

(script
  (script_block
    (param_block (parameter_list
      (parameter_declaration
        (attribute (identifier)) (variable))))
  (statement_list
    (statement (boolean_value)))))

===
Multiple parameters with attributes
===

PARAM ([string] $arg1, [string] $arg2)

$a

---

(script
  (script_block
    (param_block
      (parameter_list
        (parameter_declaration
          (attribute (identifier)) (variable))
        (parameter_declaration
          (attribute (identifier)) (variable))))
    (statement_list (statement (variable)))))

===
Multiple parameters with attributes, separated by commas
===

PARAM (
  [string] $arg1,
  [string] $arg2
)

$a

---

(script
  (script_block
    (param_block
      (parameter_list
        (parameter_declaration
          (attribute (identifier)) (variable))
        (parameter_declaration
          (attribute (identifier)) (variable))))
    (statement_list (statement (variable)))))

===
Multiple parameters with multiple attributes, separated by commas
===

PARAM (
  [Parameter]
  [string]
  $arg1,

  [Parameter]
  [string]
  $arg2
)

$a

---

(script
  (script_block
    (param_block
      (parameter_list
        (parameter_declaration
          (attribute (identifier)) (attribute (identifier)) (variable))
        (parameter_declaration
          (attribute (identifier)) (attribute (identifier)) (variable))))
    (statement_list (statement (variable)))))

===
Parameter with attributes, one with argument
===

param(
  [Parameter(ParameterSetName="p1")]
  [DateTime]
  $d
)

$true

---

(script
  (script_block
    (param_block
      (parameter_list
        (parameter_declaration
          (attribute (identifier)
            (attribute_arguments
              (attribute_argument (identifier) (string))))
          (attribute (identifier))
          (variable))))
    (statement_list (statement (boolean_value)))))

===
Parameter with attributes, one with multiple arguments
===

param(
  [Parameter(ParameterSetName="p1", Position=0)]
  [DateTime]
  $d
)

$true

---

(script
  (script_block
    (param_block
      (parameter_list
        (parameter_declaration
          (attribute (identifier)
            (attribute_arguments
              (attribute_argument (identifier) (string))
              (attribute_argument (identifier) (number))))
          (attribute (identifier))
          (variable))))
    (statement_list (statement (boolean_value)))))
